package tests.crib;

public class ArrayList {
    /*
Операции с ArrayList

Методы	Описание
void add(тип value)                 Добавляет в список переданный элемент
void add(int index, тип value)      Добавляет элемент в определенное место списка.
тип get(int index)                  Возвращает элемент, который находится под номером index
void set(int index, тип value)      Меняет значение элемента с номером index на value
тип remove(int index)               Удаляет элемент под номером index. Возвращает удаленный элемент.
тип remove(тип value)               Удаляет элемент: нужно передать сам элемент в список.
                                    Если таких элементов несколько, будет удален первый из них.
void clear()                        Очищает список — удаляет все элементы из списка.
boolean contains(тип value)         Проверяет, содержится ли в списке элемент value.
boolean isEmpty()                   Проверяет, пустой список или нет. Равна ли длина списка нулю.
int size()                          Возвращает размер списка — количество элементов списка.
тип[] toArray(тип[] array)          Возвращает массив, содержащий те же элементы, что и список.
                                    Массив нужно передать в метод.

     */

}
