package tests.crib;

public class HashMap {
    /*
    Метод	Описание
void put(ТКлюч key, ТЗначение value)            Добавляет в коллекцию пару (key, value)
Т Значение get(ТКлюч key)                       Возвращает значение по ключу.
boolean containsKey(ТКлюч key)                  Проверяет наличие ключа в коллекции
boolean containsValue(ТЗначение value)          Проверяет наличие значения в коллекции
Т Значение remove(ТКлюч key)                    Удаляет элемент из коллекции
void clear()                                    Очищает коллекцию: удаляет все элементы
int size()                                      Возвращает количество пар элементов в коллекции
Set<ТКлюч> keySet()                             Возвращает множество ключей коллекции
Collection<Т Значение> values()                  Возвращает множество элементов коллекции
Set<Map.Entry<TКлюч, TЗначение>> entrySet()     Возвращает все значения коллекции в виде множества
                                                (Set) пар (Map.Entry).


     */
}
