package tests.crib;

public class ListSetMapQueue {
    /*
    Контейнерами или коллекциями называют классы, которые позволяют хранить и обрабатывать много объектов сразу.

Тип коллекции	        Класс	            Описание
-----------------------------------------------------------
List                ArrayList           Список
                    LinkedList          Связный список
                    Vector              Вектор
                    Stack               Стэк (стопка)
------------------------------------------------------------
Set                 HashSet             Множество
                    TreeSet
                    LinkedHashSet
------------------------------------------------------------
Queue               PriorityQueue       Очередь
                    ArrayQueue
------------------------------------------------------------
Map                 HashMap             Карта/Словарь
                    TreeMap
                    HashTable
-------------------------------------------------------------
У класса HashSet есть такие методы:

    Метод	                                Описание

void add(Тип value)                 Добавляет элемент value в коллекцию
boolean remove(Тип value)           Удаляет элемент value из коллекции.
                                    Возвращает true, если там такой элемент был

boolean contains(Тип value)         Проверяет, есть ли в коллекции элемент value
void clear()                        Очищает коллекцию: удаляет все элементы
int size()                          Возвращает количество элементов в коллекции
---------------------------------------------------------------------------------
Итератор в коллекции

У объекта-итератора есть 3 метода:

        Метод	                    Описание
Тип next()              Возвращает очередной элемент коллекции
boolean hasNext()       Проверяет, есть ли еще не пройденные элементы
void remove()           Удаляет текущий элемент коллекции


     */
}
