package tests.crib;

public class PrintStream {
    /*
    Класс PrintStream унаследован от класса FilterOutputStream, а тот унаследован от OutputStream. Поэтому класс PrintStream имеет все методы классов-родителей и плюс свои. Вот самые интересные из них:

void print(obj)         Преобразует переданной объект в строку и выводит в целевой поток.
void println(obj)       Преобразует переданный объект в строку и выводит в целевой поток.
                        Добавляет в конце символ переноса строки
void println()          Выводит в целевой поток символ переноса строки
PrintStream format(String format, args...)  Конструирует и выводит строку на основе строки шаблона и переданных
                                            аргументов, по аналогии с методом String.format()
     */
}
